Revit 2024 API
FlowDirectionType Enumeration
 An enumerated type listing direction types for a connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum FlowDirectionType
Visual Basic
Public Enumeration FlowDirectionType
Visual C++
public enum class FlowDirectionType
Members
Member name | Description
Bidirectional |  Flow bidirectional
In |  Flow in
Out |  Flow out
See Also
Autodesk.Revit.DB Namespace